# Module 5: Data manipulation

In [1]:
import pandas as pd
import numpy as np

### ndim
returns the number of dataframe dimensions

In [6]:
ser = pd.Series([1, 2, 3, 4, 11, 22, 33])
ser.ndim

1

### axes()
returns a list if axes of the row labels

In [7]:
ser.axes

[RangeIndex(start=0, stop=7, step=1)]

### values()
returns the actual data in the series of array

In [8]:
ser = pd.Series(np.arange(1, 30))
print(type(ser))
val = ser.values
print(type(val))
print(val)

<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>
[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 25 26 27 28 29]

### head(n=5)
returns the first n rows of the dataframe or series

In [9]:
ser.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
ser.head(2)

0    1
1    2
dtype: int64

In [11]:
ser.head(10)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
ser

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
23    24
24    25
25    26
26    27
27    28
28    29
dtype: int64

### tail(n=5)
returns the last five values of dataframe or series

In [13]:
ser.tail()

24    25
25    26
26    27
27    28
28    29
dtype: int64

In [14]:
ser.tail(3)

26    27
27    28
28    29
dtype: int64

## sum()
it returns the sum of the values for the requested axis

In [15]:
data = {'odd':np.arange(1,100,2),
       'even':np.arange(0,100,2)}
df = pd.DataFrame(data)
df.head()

   odd  even
0    1     0
1    3     2
2    5     4
3    7     6
4    9     8

In [16]:
df.sum()  # by defaul axis=0 i.e add values of each column

odd     2500
even    2450
dtype: int64

In [21]:
df.sum()['even']

2450

In [ ]:
df.sum(axis=1)  # axis=1 means add values based on row

In [ ]:
# if i want to ignore some column in this sum then?
df[['col1', 'col2', 'col3']].sum()

In [26]:
# df with columns of numbers and strings
data = {'odd':np.arange(1,100,2),
       'even':np.arange(0,100,2),
       'chars':['a']*10+['b']*20+ ['c']*10+[1,2,3,4,5,6,7,8,9,10]}
df = pd.DataFrame(data)
df.head()

   odd  even chars
0    1     0     a
1    3     2     a
2    5     4     a
3    7     6     a
4    9     8     a

In [29]:
df.dtypes

odd       int64
even      int64
chars    object
dtype: object

In [28]:
df.sum()

odd     2500
even    2450
dtype: int64

### std()
returns the standard deviation of the values for the requested axis

In [32]:
df.std() # axis=0,  by default

odd     29.154759
even    29.154759
dtype: float64

In [33]:
df.std(axis=1)

0     0.707107
1     0.707107
2     0.707107
3     0.707107
4     0.707107
5     0.707107
6     0.707107
7     0.707107
8     0.707107
9     0.707107
10    0.707107
11    0.707107
12    0.707107
13    0.707107
14    0.707107
15    0.707107
16    0.707107
17    0.707107
18    0.707107
19    0.707107
20    0.707107
21    0.707107
22    0.707107
23    0.707107
24    0.707107
25    0.707107
26    0.707107
27    0.707107
28    0.707107
29    0.707107
30    0.707107
31    0.707107
32    0.707107
33    0.707107
34    0.707107
35    0.707107
36    0.707107
37    0.707107
38    0.707107
39    0.707107
40    0.707107
41    0.707107
42    0.707107
43    0.707107
44    0.707107
45    0.707107
46    0.707107
47    0.707107
48    0.707107
49    0.707107
dtype: float64

## Iterating over a Dataframe using iteritems()
iterating column wise

In [36]:
import pandas as pd
import numpy as np
array_2d = np.random.rand(5,4)
df = pd.DataFrame(array_2d, columns=['col1', 'col2', 'col3','col4'])
df

       col1      col2      col3      col4
0  0.453218  0.338151  0.447598  0.913234
1  0.502362  0.335980  0.527927  0.947032
2  0.206308  0.303047  0.404784  0.454821
3  0.093743  0.575225  0.108689  0.196964
4  0.383380  0.154569  0.057191  0.063000

In [37]:
# iterating over a df and getting each column in each iteration
for key, value in df.iteritems():
    print("Column name:", key)
    print(value)
    print("#"*20)

Column name: col1
0    0.453218
1    0.502362
2    0.206308
3    0.093743
4    0.383380
Name: col1, dtype: float64
####################
Column name: col2
0    0.338151
1    0.335980
2    0.303047
3    0.575225
4    0.154569
Name: col2, dtype: float64
####################
Column name: col3
0    0.447598
1    0.527927
2    0.404784
3    0.108689
4    0.057191
Name: col3, dtype: float64
####################
Column name: col4
0    0.913234
1    0.947032
2    0.454821
3    0.196964
4    0.063000
Name: col4, dtype: float64
####################

## Iterating over a Dataframe using iterrows()
iterating row wise

In [39]:
import pandas as pd
import numpy as np
array_2d = np.random.rand(5,4)
df = pd.DataFrame(array_2d, columns=['col1', 'col2', 'col3','col4'])
df

       col1      col2      col3      col4
0  0.405388  0.103227  0.454076  0.739656
1  0.321530  0.224500  0.466303  0.669480
2  0.352798  0.466885  0.624352  0.024071
3  0.122650  0.120616  0.114286  0.172831
4  0.147990  0.667270  0.320575  0.075006

In [40]:
for key, value in df.iterrows():
    print("Row index:", key)
    print(value)  # access a particular column using value[<column_name>]

Row index: 0
col1    0.405388
col2    0.103227
col3    0.454076
col4    0.739656
Name: 0, dtype: float64
Row index: 1
col1    0.321530
col2    0.224500
col3    0.466303
col4    0.669480
Name: 1, dtype: float64
Row index: 2
col1    0.352798
col2    0.466885
col3    0.624352
col4    0.024071
Name: 2, dtype: float64
Row index: 3
col1    0.122650
col2    0.120616
col3    0.114286
col4    0.172831
Name: 3, dtype: float64
Row index: 4
col1    0.147990
col2    0.667270
col3    0.320575
col4    0.075006
Name: 4, dtype: float64

## Iterating over a Dataframe using itertuples()
iterator yielding a named tuple for each row

In [ ]:
# how named tuples work ?

import collections
Edureka = collections.namedtuple('Edureka', 'name age gender')
print(Edureka) # this is a named tuple

# how to put values in it
ravi = Edureka(age=25, name='Ravi', gender='M')
print(ravi)
# how to access value from named tuple
print(ravi.name)
print(ravi.age)

#indexing would continue to work in named tuple
print(ravi[0])  # name
print(ravi[1])  # age

In [41]:
# let's see how itertuples() work
import pandas as pd
import numpy as np
array_2d = np.random.rand(5,4)
df = pd.DataFrame(array_2d, columns=['col1', 'col2', 'col3','col4'])
df

       col1      col2      col3      col4
0  0.885186  0.600598  0.280451  0.889990
1  0.368089  0.560297  0.921845  0.637586
2  0.239727  0.736625  0.566101  0.813831
3  0.700177  0.458875  0.515358  0.353319
4  0.604202  0.477202  0.159904  0.617866

In [42]:
for row in df.itertuples():
    print(row) # this is named tuple
    # you can access any colum using row.col1, row.col2 ..
    print('#####')

Pandas(Index=0, col1=0.8851862261067877, col2=0.6005979423011114, col3=0.2804514820793278, col4=0.889989626703046)
#####
Pandas(Index=1, col1=0.3680894868536637, col2=0.5602971346281126, col3=0.921844610172755, col4=0.6375857951197712)
#####
Pandas(Index=2, col1=0.23972717000573396, col2=0.7366254692633083, col3=0.5661011892214595, col4=0.8138308038391179)
#####
Pandas(Index=3, col1=0.7001773024679909, col2=0.4588751909871157, col3=0.5153583242802146, col4=0.35331886071725627)
#####
Pandas(Index=4, col1=0.6042021172992728, col2=0.4772021383206232, col3=0.15990381021102773, col4=0.6178664118484304)
#####

In [44]:
for row in df.itertuples():
    print(row.col1, row.col2) # this is named tuple
    # you can access any colum using row.col1, row.col2 ..
    print('#####')

0.8851862261067877 0.6005979423011114
#####
0.3680894868536637 0.5602971346281126
#####
0.23972717000573396 0.7366254692633083
#####
0.7001773024679909 0.4588751909871157
#####
0.6042021172992728 0.4772021383206232
#####

## GroupBy operation

In [46]:
import pandas as pd

world_cup={'Team':['West Indies','West Indies','India',
                   'Australia','Pakistan','Sri Lanka','Australia',
                   'Australia','Australia','India','Australia'],
           'Rank':[7,7,2,1,6,4,1,1,1,2,1],
           'Year':[1975,1979,1983,1987,1992,1996,1999,2003,2007,2011,2015]}
df=pd.DataFrame(world_cup)
df

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     1  2015

In [47]:
# grouping based on 'Team' column
df.groupby('Team')

In [48]:
df.groupby('Team').groups

{'Australia': Int64Index([3, 6, 7, 8, 10], dtype='int64'),
 'India': Int64Index([2, 9], dtype='int64'),
 'Pakistan': Int64Index([4], dtype='int64'),
 'Sri Lanka': Int64Index([5], dtype='int64'),
 'West Indies': Int64Index([0, 1], dtype='int64')}

In [49]:
# accessing a particular group
df.groupby('Team').get_group('Australia')

         Team  Rank  Year
3   Australia     1  1987
6   Australia     1  1999
7   Australia     1  2003
8   Australia     1  2007
10  Australia     1  2015

In [50]:
# grouping based on multi-column Team and ICC_Rank
df.groupby(['Team', 'Rank']).groups

#Note: dictionary key would be changed

{('Australia', 1): Int64Index([3, 6, 7, 8, 10], dtype='int64'),
 ('India', 2): Int64Index([2, 9], dtype='int64'),
 ('Pakistan', 6): Int64Index([4], dtype='int64'),
 ('Sri Lanka', 4): Int64Index([5], dtype='int64'),
 ('West Indies', 7): Int64Index([0, 1], dtype='int64')}

In [54]:
# groups can be iterated over just like using itertools

grouped_obj = df.groupby('Team')

for name, group in grouped_obj:
    print(name)
    print(group)
    print("*"*20)

Australia
         Team  Rank  Year
3   Australia     1  1987
6   Australia     1  1999
7   Australia     1  2003
8   Australia     1  2007
10  Australia     1  2015
********************
India
    Team  Rank  Year
2  India     2  1983
9  India     2  2011
********************
Pakistan
       Team  Rank  Year
4  Pakistan     6  1992
********************
Sri Lanka
        Team  Rank  Year
5  Sri Lanka     4  1996
********************
West Indies
          Team  Rank  Year
0  West Indies     7  1975
1  West Indies     7  1979
********************

In [55]:
# a single group can also be selected using get_group()
grouped_val = df.groupby('Team')
print(grouped_val.get_group('Australia'))

         Team  Rank  Year
3   Australia     1  1987
6   Australia     1  1999
7   Australia     1  2003
8   Australia     1  2007
10  Australia     1  2015

## Concatenation
it is the process of combining two or more data frames

In [56]:
# method 1
import pandas as pd

world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)

print("Concatenated dfs")
print(pd.concat([df1, df2], sort=True))

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656
Concatenated dfs
   ICC_rank  Points          Team  World_champions_Year
0         2     874         India                2011.0
1         3     787     Australia                2015.0
2         7     753   West Indies                1979.0
3         8     673      Pakistan                1992.0
4         4     855     Sri Lanka                1996.0
0         1     895  South Africa                   NaN
1         5     764   New Zealand                   NaN
2         9     656      Zimbabwe                   NaN

In [58]:
# method 2
# appending the dataframes
world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1 = pd.DataFrame(world_champions)
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [59]:
df2 = pd.DataFrame(chokers)
df2

           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

In [60]:
df1.append(df2, sort=True)

   ICC_rank  Points          Team  World_champions_Year
0         2     874         India                2011.0
1         3     787     Australia                2015.0
2         7     753   West Indies                1979.0
3         8     673      Pakistan                1992.0
4         4     855     Sri Lanka                1996.0
0         1     895  South Africa                   NaN
1         5     764   New Zealand                   NaN
2         9     656      Zimbabwe                   NaN

In [61]:
# concatenation by changing the default axis
# method 1
import pandas as pd

world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
df1

DF1: World champions

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [62]:
print("DF2: Chokers")
df2

DF2: Chokers

           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

In [65]:

print("Concatenated dfs")
new_df = pd.concat([df1, df2], sort=True,
           axis=1) #######
new_df

Concatenated dfs

,Team,ICC_rank,World_champions_Year,Points,Team,ICC_rank,Points
0,India,2,2011,874,South Africa,1.0,895.0
1,Australia,3,2015,787,New Zealand,5.0,764.0
2,West Indies,7,1979,753,Zimbabwe,9.0,656.0
3,Pakistan,8,1992,673,NaN,NaN,NaN
4,Sri Lanka,4,1996,855,NaN,NaN,NaN

In [66]:
new_df['ICC_rank']

   ICC_rank  ICC_rank
0         2       1.0
1         3       5.0
2         7       9.0
3         8       NaN
4         4       NaN

# Merging and Joining
merging is the pandas operation that performs database joins

In [69]:
champion_stats={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

match_stats={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka','Hong-Kong'],
             'World_cup_played':[11,10,11,9,8,0],
             'ODIs_played':[733,988,712,679,662,10]}

df1=pd.DataFrame(champion_stats)
df2=pd.DataFrame(match_stats)

In [70]:
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [71]:
df2

          Team  World_cup_played  ODIs_played
0        India                11          733
1    Australia                10          988
2  West Indies                11          712
3     Pakistan                 9          679
4    Sri Lanka                 8          662
5    Hong-Kong                 0           10

In [72]:
# merging on the basis of a column 'Team'
pd.merge(df1, df2, on='Team')  # inner join

,Team,ICC_rank,World_champions_Year,Points,World_cup_played,ODIs_played
0,India,2,2011,874,11,733
1,Australia,3,2015,787,10,988
2,West Indies,7,1979,753,11,712
3,Pakistan,8,1992,673,9,679
4,Sri Lanka,4,1996,855,8,662

### Left join
it merges two objects based on the keys from the left object

In [73]:
world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)

In [74]:
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [75]:
df2

           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

In [76]:
pd.merge(df1, df2, on='Team', how='left')

,Team,ICC_rank_x,World_champions_Year,Points_x,ICC_rank_y,Points_y
0,India,2,2011,874,NaN,NaN
1,Australia,3,2015,787,NaN,NaN
2,West Indies,7,1979,753,NaN,NaN
3,Pakistan,8,1992,673,NaN,NaN
4,Sri Lanka,4,1996,855,NaN,NaN

## Right join

In [77]:

import pandas as pd

champion_stats={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}
chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1=pd.DataFrame(champion_stats)
df2=pd.DataFrame(chokers)

In [78]:
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [79]:
df2

           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

In [80]:
pd.merge(df1, df2, on='Team', how='right')

,Team,ICC_rank_x,World_champions_Year,Points_x,ICC_rank_y,Points_y
0,South Africa,NaN,NaN,NaN,1,895
1,New Zealand,NaN,NaN,NaN,5,764
2,Zimbabwe,NaN,NaN,NaN,9,656

## Outer join
merges two dfs based on the full union of the columns of both the objects

In [81]:

import pandas as pd

champion_stats={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}
chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1=pd.DataFrame(champion_stats)
df2=pd.DataFrame(chokers)

In [82]:
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [83]:
df2

           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

In [84]:
pd.merge(df1, df2, on='Team', how='outer')

,Team,ICC_rank_x,World_champions_Year,Points_x,ICC_rank_y,Points_y
0,India,2.0,2011.0,874.0,NaN,NaN
1,Australia,3.0,2015.0,787.0,NaN,NaN
2,West Indies,7.0,1979.0,753.0,NaN,NaN
3,Pakistan,8.0,1992.0,673.0,NaN,NaN
4,Sri Lanka,4.0,1996.0,855.0,NaN,NaN
5,South Africa,NaN,NaN,NaN,1.0,895.0
6,New Zealand,NaN,NaN,NaN,5.0,764.0
7,Zimbabwe,NaN,NaN,NaN,9.0,656.0

## Inner join
intersection of two objects

In [86]:

import pandas as pd

champion_stats={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}
chokers={'Team':['India','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1=pd.DataFrame(champion_stats)
df2=pd.DataFrame(chokers)
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [87]:
df2

          Team  ICC_rank  Points
0        India         1     895
1  New Zealand         5     764
2     Zimbabwe         9     656

In [88]:
pd.merge(df1, df2, on='Team', how='inner')
#pd.merge(df1, df2, on='Team')  # same as above

    Team  ICC_rank_x  World_champions_Year  Points_x  ICC_rank_y  Points_y
0  India           2                  2011       874           1       895